# MatchlineBottomOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MatchlineBottomOffset Property
ParameterTypeId Class See Also
---
"Bottom Offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MatchlineBottomOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MatchlineBottomOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MatchlineBottomOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace